УНФ_ТЕСТ.BizOn_WMS_MES/src/Documents/БЗ_ПриемкаВЯчейки/БЗ_ПриемкаВЯчейки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>БЗ_ПриемкаВЯчейки</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПриходнаяНакладная</types>
    </type>
  </attributes>
  <attributes>
    <name>ОткрытНаТСД</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заавершен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.БЗ_Сотрудники_ТСД</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокДвижение</name>
    <type>
      <types>DocumentRef.ПеремещениеЗапасов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТСД_ВводДанных</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Ячейка</name>
      <type>
        <types>CatalogRef.Ячейки</types>
      </type>
    </attributes>
    <attributes>
      <name>План</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Факт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Добавлено</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.БЗ_WMS_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Enums/СтатусыПартий/СтатусыПартий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыПартий</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ДавальческоеСырье</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>СобственныеЗапасы</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УНФ_ТЕСТ.BizOn_WMS_MES/src/Documents/БЗ_ПриемкаВЯчейки/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		кратностьДопРеквизит=ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "Кратность_1ac2b3c35ee44c6e92ff4b8ade8f68da");
		Дата=ТекущаяДАта();
		ДокументОснование=данныеЗаполнения;
		Для каждого стр из данныеЗаполнения.запасы цикл
			кратность=0;
			если ЗНачениеЗАполнено(стр.характеристика) Тогда
				Для каждого стрДопРеквизит из стр.характеристика.дополнительныеРеквизиты цикл
					Если стрДопРеквизит.свойство=КратностьДопРеквизит тогда
						кратность=стрДопРеквизит.значение;		
					КонецЕсли;					
				КонецЦикла;
			КонецЕсли;
			Если Кратность= 0 тогда
				новстр=запасы.Добавить();
				ЗаполнитьЗначенияСвойств(новстр, стр);
			иначе
				количество=стр.количество;
				сч=0;
		 		пока количество>0 цикл   
					сч=сч+1;
					Партия=Справочники.ПартииНоменклатуры.СоздатьЭлемент();         
					Партия.Наименование=Строка(сч)+" "+Строка(данныеЗаполнения.номер)+" "+Строка(стр.характеристика.код); 
					Партия.Владелец=стр.номенклатура;  
					партия.статус=Перечисления.СтатусыПартий.СобственныеЗапасы;
					партия.ВладелецПартии=ДанныеЗаполнения.Контрагент;
					Партия.Записать();
					новстр=запасы.Добавить();					
					ЗаполнитьЗначенияСвойств(новстр, стр);	
					новстр.Ячейка= Партия.Ссылка;
					Если Количество>Кратность тогда						
						новстр.Количество=кратность;
						количество=количество-кратность;
					Иначе	
						новстр.Количество=Количество;
						количество=0;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;			
		КонецЦикла; 
		Для каждого стр из Запасы цикл
			новстр=ТСД_ВводДанных.Добавить();
			ЗаполнитьЗНаченияСвойств(новстр, стр); 
			новстр.план=стр.Количество;		
		КонецЦикла;		
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьЕАН8()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ПРАВ(Ячейки.БЗ_ШК, 7)) КАК БЗ_ШК
		|ИЗ
		|	Справочник.Ячейки КАК Ячейки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	кодшк=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	    кодшк=ВыборкаДетальныеЗаписи.БЗ_ШК+1;
	КонецЦикла;	                                              
	кодшк1=Формат(кодшк, "ЧЦ=7; ЧВН=; ЧГ=");
	возврат  СтрШаблон("%1%2", кодшк1, КонтрольныйСимволEAN(кодшк1, 8));	
КонецФункции  

Функция КонтрольныйСимволEAN(Знач ШтрихКод, Знач Тип)
	
	Четн = 0;
	Нечетн = 0;
	
	КоличествоИтераций = ?(Тип = 13, 6, 4);
	
	Для Индекс = 1 По КоличествоИтераций Цикл
		Если (Тип = 8) И (Индекс = КоличествоИтераций) Тогда
		Иначе
			Четн   = Четн   + Сред(ШтрихКод, 2 * Индекс, 1);
		КонецЕсли;
		Нечетн = Нечетн + Сред(ШтрихКод, 2 * Индекс - 1, 1);
	КонецЦикла;
	
	Если Тип = 13 Тогда
		Четн = Четн * 3;
	Иначе
		Нечетн = Нечетн * 3;
	КонецЕсли;
	
	КонтЦифра = 10 - (Четн + Нечетн) % 10;
	
	Возврат ?(КонтЦифра = 10, "0", Строка(КонтЦифра));
	
КонецФункции // КонтрольныйСимволEAN()
